design_model/src/main/resources/行为型模式/访问者模式/访问者模式.md
```mermaid
classDiagram
    class Visitor {
        <<抽象访问者>>
        +visitConcreteElementA(ConcreteElementA elementA)*
        +visitConcreteElementB(ConcreteElementB elementB)*
    }
    class ConcreteVisitorA {
        <<具体访问者>>
        +visitConcreteElementA(ConcreteElementA elementA)
        +visitConcreteElementB(ConcreteElementB elementB)
    }
    class ConcreteVisitorB {
        <<具体访问者>>
        +visitConcreteElementA(ConcreteElementA elementA)
        +visitConcreteElementB(ConcreteElementB elementB)
    }
    class Element {
        <<抽象元素>>
        +accept(Visitor visitor)*
    }
    class ConcreteElementA {
        <<具体抽象类>>
        +accept(Visitor visitor)
        +operationA()
    }
    class ConcreteElementB {
        <<具体抽象类>>
        +accept(Visitor visitor)
        +operationB()
    }
    class ObjectStructure {
        <<对象结构>>
        -List<Element> elements
        +void addEement(Element element)
        +accept(Visitor visitor) "elements.forEach(Element::accept)"
    }
    ConcreteVisitorA --|> Visitor
    ConcreteVisitorB --|> Visitor
    ConcreteElementA --|> Element
    ConcreteElementB --|> Element
    ObjectStructure --> Element
    Client --> ObjectStructure
    Client --> Visitor
```
